export default {
  term_and_conditions: 'ข้อตกลงและเงื่อนไข',
  before_usage: 'ก่อนการเริ่มต้นใช้งาน',
  please_accept_terms: 'กรุณายอมรับข้อตกลงและเงื่อนไข',
  i_accept_term: 'ฉันยอมรับข้อตกลงและเงื่อนไข',
  accept: 'ยอมรับ',
  deny: 'ปฎิเสธ',
  load_use_fight: 'ร่วมโหลด ร่วมใช้ ร่วมใจ',
  covid19_together: 'พิชิตโควิด-19',
  register: 'ลงทะเบียน',
  wrong_pwd: 'รหัสผ่านไม่ถูกต้อง',
  error: 'เกิดข้อผิดพลาด',
  enter_otp_from_sms: 'กรอกรหัสจาก SMS',
  send_to_phone_no: 'ส่งไปที่เบอร์',
  resend_the_code: 'ส่งรหัสใหม่',
  next: 'ถัดไป',
  use_without_iden_confirm: 'ใช้งานแบบไม่ยืนยันตัวตน',
  pls_input_phone_no: 'กรอกเบอร์โทรศัพท์',
  confirm_otp_from_sms: 'เพื่อยืนยันรหัสผ่านจาก SMS',
  your_phone_no: 'เบอร์โทรศัพท์ของคุณ',
  confirm_phone_no: 'ยืนยันเบอร์โทรศัพท์',
  confirm_phone_no_so_we_can_take_care:
    'ยืนยันเบอร์โทรศัพท์ เพื่อให้เราติดต่อดูแลคุณได้',
  confirm_now: 'ยืนยันเลย',
  later: 'ไว้ทีหลัง',
  risky_ppl_nearby: 'มีคนเสี่ยงอยู่ใกล้ ๆ',
  app_can_check_with_bluetooth: 'หมอตรวจสอบได้ด้วยบลูทูธ',
  pls_grant_bluetooth_access: 'ขอสิทธิ์เข้าถึงบลูทูธ Bluetooth',
  consume_low_energy_and_can_detect_closed_contact:
    'ใช้พลังงานต่ำ เพื่อคอยสแกนคนใกล้ตัวและแจ้งเตือนทันทีหากคุณได้ไปใกล้ชิดกับคนที่มีความเสี่ยง',
  grant_permission: 'อนุญาตให้เข้าถึง',
  register_successfully: 'ลงทะเบียนสำเร็จ',
  can_start_using_now: 'เริ่มใช้งานได้ทันที',
  start: 'เริ่มใช้งาน',
  profile_picture: 'ภาพโปรไฟล์',
  straight_and_clear_face_portrait: 'ถ่ายรูปหน้าตรง เห็นหน้าชัดเจน',
  retake_photo: 'ถ่ายใหม่',
  take_photo: 'ถ่ายรูป',
  pls_grant_permission: 'ขอสิทธิ์เข้าถึงข้อมูล',
  let_doc_estimate_your_risk: 'เพื่อให้หมอประเมินความเสี่ยงของคุณ',
  your_position: 'ตำแหน่งของคุณ',
  help_notify_if_you_get_near_risky_person_or_area:
    'เพื่อคอยแจ้งเตือนหากคุณได้ไปใกล้ชิดกับคนที่มี ความเสี่ยง หรืออยู่ในพื้นที่เสี่ยง',
  your_motion: 'การเคลื่อนที่ของคุณ (MOTION)',
  to_manage_mobile_energy_efficiently:
    'เพื่อจัดการการใช้พลังงานของมือถือ อย่างมีประสิทธิภาพ',
  let_doc_notify_you: 'ให้หมอแจ้งเตือนคุณ',
  when_you_are_closed_to_risky_ppl: 'เมื่อคุณอยู่ใกล้ชิดกับคนที่มีความเสี่ยง',
  turn_on_notification: 'เปิดการแจ้งเตือน',
  in_progress: 'กำลังดำเนินการ...',
  please_wait: 'กรุณารอสักครู่',
  verify_iden_here: 'ยืนยันตัวตนที่นี่',
  check_by_app: 'ตรวจโดยแอปพลิเคชัน',
  undetermined_risk: 'ยังไม่ทราบความเสี่ยง',
  wait_a_moment: 'รอสักครู่...',
  no_update_for: 'ไม่ได้อัปเดตเป็นเวลา',
  minute_s: 'นาที',
  last_update: 'อัปเดตล่าสุด',
  fully_date: 'DD MMMM Y HH:mm น.',
  hh_mm: 'HH:mm น.',
  can_not_generate_qr: 'ไม่สามารถสร้าง QR ได้',
  connect_internet_to_generate_qr: 'เชื่อมต่ออินเทอร์เน็ตเพื่อสร้าง QR',
  try_again: 'ลองอีกครั้ง',
  qr_expired: 'QR หมดอายุแล้ว',
  connect_internet_to_update: 'เชื่อมต่ออินเทอร์เน็ตเพื่ออัปเดต',
  for_checking_in_with_qr: 'สำหรับนำ QR Code ไปใช้ check-in',
  press_to_confirm: 'กดเพื่อยืนยัน',
  can_not_change_picture: 'ไม่สามารถเปลี่ยนรูปได้',
  can_change_pic_again_in: 'คุณจะสามารถเปลี่ยนรูปได้อีกใน',
  day_s: ' วัน',
  are_you_sure: 'คุณแน่ใจไหม ?',
  after_changed_pic_you_will_not_be_able_to_change_until:
    'เมื่อคุณเปลี่ยนรูปแล้ว ในอีก',
  day_s_have_passed: 'วันคุณจะไม่สามารถเปลี่ยนรูปได้อีกครั้ง',
  cancel: 'ยกเลิก',
  confirm: 'ยืนยัน',
  data: 'ข้อมูล',
  scan_qr: 'สแกน QR',
  settings: 'ตั้งค่า',
  risk: 'ความเสี่ยง',
  scan_result: 'ผลลัพธ์การสแกน',
  data_at: 'ข้อมูลวันที่',
  por_sor: 'พ.ศ',
  scan_again: 'สแกนใหม่อีกครั้ง',
  wrong_data: 'ข้อมูลไม่ถูกต้อง',
  record_contact_and_estimate_risk:
    'เพื่อบันทึกการเข้าใกล้และตรวจสอบความเสี่ยง',
  already_registered: 'ลงทะเบียนมาแล้ว',
  tracking: 'ระบบค้นหา',
  track_with_bluetooth: 'การค้นหาด้วยบลูทูธ:',
  auto_turn_on_bluetooth_tracing:
    'เปิดการค้นหาการเข้าใกล้บุคคลอื่นผ่านบลูทูธพลังงานต่ำโดยอัตโนมัติ',
  may_cause_phone_to_consume_higher_energy:
    'อาจส่งผลให้มือถือมีการใช้พลังงานมากกว่าปกติ',
  you_can_choose_to_turn_off: 'สามารถเลือกปิดได้ถ้าต้องการ',
  but_sys_will_not_auto_trace:
    'แต่ระบบจะไม่สามารถค้นหาอุปกรณ์อื่นโดยอัตโนมัติได้',
  general: 'ทั่วไป',
  privacy_policy: 'นโยบายความเป็นส่วนตัว',
  do_questionaire_again: 'ทำแบบประเมินตนเองอีกครั้ง',
  identity_confirm: 'ยืนยันตัวตน',
  any_symptom: 'คุณมีอาการดังต่อไปนี้หรือไม่ ?',
  q_any_symptom: 'กรุณาเลือกอาการที่ตรงกับคุณ เลือกได้มากกว่า 1 อาการ',
  high_fever: 'มีไข้สูง 37.5 องศาขึ้นไป',
  cough: 'ไอ',
  sore_throat: 'เจ็บคอ',
  shortness_of_breath: 'เหนื่อยหอบผิดปกติ',
  vomit: 'อาเจียน',
  none_of_above: 'ไม่มีอาการใด ๆ ข้างต้น',
  travel_abroad: 'คุณได้เดินทางไปต่างประเทศในช่วง 14 วันก่อนหรือไม่ ?',
  went_oversea: 'ได้ไปต่างประเทศ',
  didnt_go_oversea: 'ไม่ได้ไปต่างประเทศ',
  get_near_covid_risk_ppl_past_14_days:
    'คุณได้อยู่ใกล้ชิดกับคนที่มีความเสี่ยงในช่วง 14 วันก่อนหรือไม่ ?',
  more_than_5_ppl_with_fever_around_you:
    'มีผู้ใกล้ชิดป่วยเป็นไข้หวัดพร้อมกัน มากกว่า 5 คน',
  just_back_from_abroad_person_at_home: 'มีบุคคลในบ้านเดินทางไปต่างประเทศ',
  closed_contact_with_covid19_confirmed_case:
    'อยู่ใกล้ชิดกับผู้ป่วยยืนยัน COVID-19 (ใกล้กว่า 1 เมตร นานเกิน 5 นาที)',
  none_of_history_above: 'ไม่มีประวัติข้างต้น',
  occupation_involving_foreigners:
    'คุณได้ประกอบอาชีพที่ใกล้ชิดกับชาวต่างชาติหรือไม่ ?',
  yes: 'ใช่',
  no: 'ไม่ใช่',
  is_medical_staff: 'เป็นบุคลากรทางการแพทย์',
  you_are_a_medical_staff: 'คุณเป็นเป็นบุคลากรทางการแพทย์',
  know_status_of_ppl_around_you: 'รู้สถานะคนใกล้ชิด',
  take_appropriate_action: 'ระวังและปฏิบัติตัวได้เหมาะสม',
  know_the_guideline: 'ทราบข้อควรปฏิบัติ',
  reduce_covid_spread: 'เพื่อลดความเสี่ยงในการแพร่เชื้อ',
  increase_safety: 'เพิ่มความปลอดภัย',
  like_having_doctor_with_you: 'เหมือนมีหมออยู่ใกล้คุณ',
  let_dr_chana_check_symptoms: 'หมอชนะแวะมาสอบถามอาการ',
  of_you: 'ของคุณ',
  hello_dr_chana_come_to_eval_u: 'สวัสดีครับ วันนี้หมอแวะมาประเมินอาการของคุณ',
  suggest_guideline: 'หมอจะแนะนำวิธีปฏิบัติตัวของคุณ',
  for_appropriate_level: 'ให้เหมาะสมกับความเสี่ยงที่หมอประเมินได้',
  start_eval: 'เริ่มประเมิน',
  very_low: 'ต่ำมาก',
  low: 'ต่ำ',
  medium: 'กลาง',
  med_panklang: 'ปานกลาง',
  very_high: 'สูงมาก',
  doc_will_give_u_qr: 'หมอจะให้ QR Code',
  for_risk_assessment: 'สำหรับตรวจสอบความเสี่ยง',
  risk_level: 'ระดับความเสี่ยง',
  receive_qr_code: 'รับ QR Code',
  for_using_service: 'ในการใช้บริการ',
  close: 'ปิด',
  system_closed: 'ระบบได้ปิดให้บริการแล้ว',
  pls_set_loc_serv_as_always:
    'กรุณาเปิด Location services เป็น Always ให้หมอชนะ',
  morchana_tracking_is_on: 'ระบบเฝ้าระวังของหมอชนะ ทำงาน',
  you_will_be_notified_when_closed_to_risky_ppl:
    'คุณจะได้รับการแจ้งเตือนทันที เมื่อคุณได้ไปใกล้ชิดกับคนที่มีความเสี่ยง',
  pls_self_iden_with_phone_no: 'กรุณายืนยันตัวตนด้วยเบอร์โทรศัพท์',
  to_help_refining_risk_assessment_result:
    'เพื่อนำผลประเมิน COVID-19 มาปรับปรุงผลการประเมิน',
  you_are_orange_now_title: 'สถานะของคุณได้ถูกเปลี่ยนเป็นสีส้ม',
  went_to_risky_zone_quar_14d_observe_if_fever_respiratory_go_see_doc:
    'เนื่องจากท่านมีประวัติเดินทางจากพื้นที่เสี่ยง ให้กักตัว 14 วัน พร้อมเฝ้าระวังอาการ ถ้ามีอาการไข้ ร่วมกับ อาการระบบทางเดินหายใจ ให้ติดต่อสถานพยาบาลทันที',
  you_are_red_now_title: 'สถานะของคุณได้ถูกเปลี่ยนเป็นสีแดง',
  you_are_red_now_msg:
    'คุณเข้าสู่สภาวะเสี่ยงสูง สถานพยาบาลกำลังจะติดต่อคุณกลับไปทันที',
  orange_suggestion: 'คำแนะนำของคุณในวันนี้ (สีส้ม)',
  year: ' ปี',
  week: 'สัปดาห์',
  day: 'วัน',
  hour: 'ชม.',
  minute: 'นาที',
  second: 'วินาที',
  very_low_risk: 'ความเสี่ยงต่ำมาก',
  low_risk: 'ความเสี่ยงน้อย',
  medium_risk: 'ความเสี่ยงปานกลาง',
  high_risk: 'ความเสี่ยงสูงมาก',
  wash_hand_wear_mask_avoid_crowd: 'ล้างมือ สวมหน้ากาก หลีกเลี่ยงที่แออัด',
  maybe_other_disease_2d_not_better_go_see_doc:
    'อาจเป็นโรคอื่น ถ้า 2 วัน อาการไม่ดีขึ้นให้ไปพบแพทย์',
  go_see_doc: 'ให้ติดต่อสถานพยาบาลทันที',
  important_update: 'อัพเดทสำคัญ',
  pls_update_latest_version_from: 'กรุณาอัพเดทเวอร์ชั่นล่าสุดจาก',
  ok: 'ตกลง',
  incorrect_qr: 'QR Code ไม่ถูกต้อง',
  privacy_policy_intro_01:
    '    แอปพลิเคชัน “หมอชนะ/MorChana” ดูแลและบริหารจัดการโดยสำนักงานพัฒนารัฐบาลดิจิทัล (องค์การมหาชน) (ต่อไปในนโยบายนี้เรียกว่า “สพร.”) ตามโครงการพัฒนาระบบเฝ้าระวังเพื่อรองรับสถานการณ์ฉุกเฉินของประเทศ สำนักงานพัฒนารัฐบาลดิจิทัล (องค์การมหาชน) เพื่อเป็นเครื่องมือช่วยแพทย์ พยาบาล บุคลากรทางการแพทย์ หน่วยงานของรัฐที่มีหน้าที่เกี่ยวข้องกับการรับมือสถานการณ์การระบาดของโรคติดเชื้อไวรัสโคโรน่า 2019 (COVID-19)  หน่วยงานภาคเอกชน และผู้ใช้แอปพลิเคชัน ในการดูแลและป้องกันตนเองจากการระบาดโรค COVID-19 ',
  privacy_policy_intro_02:
    '    โดยแอปพลิเคชันนี้จะเก็บรวบรวม ใช้ และเผยแพร่ข้อมูลเท่าที่จำเป็น เพื่อป้องกันหรือระงับอันตรายต่อชีวิต ร่างกาย หรือสุขภาพอนามัยของผู้ใช้แอพลิชันนี้ ผู้ที่อยู่รอบข้าง และประชาชน โดยติดตามข้อมูลการติดเชื้อ โอกาสหรือความเสี่ยงในการติดเชื้อ และเฝ้าระวังสถานการณ์การระบาดของโรค COVID-19 จากการให้ข้อมูลของผู้ใช้แอพฯนี้เอง ',
  privacy_policy_intro_03:
    '    สพร. จึงขอให้ท่านได้อ่านนโยบายนี้อย่างรอบคอบก่อนใช้งาน รวมถึงข้อตกลงอื่นๆนอกจากนโยบายนี้ ที่มีการอ้างถึงในแอปพลิเคชัน ซึ่งข้อตกลงเหล่านี้จะมีผลผูกพันท่านในทางกฎหมายเมื่อท่านเข้าใช้งาน',
  privacy_policy_intro_04:
    '    และเมื่อท่านได้อ่านนโยบายนี้โดยตลอดและกดปุ่มยอมรับด้านล่างนโยบายนี้ ท่านได้ให้ความยินยอมในการประมวลผลข้อมูลส่วนบุคคลของท่านตามนโยบายนี้ หากท่านไม่เห็นด้วยที่จะมีการประมวลผลข้อมูลส่วนบุคคลตามนโยบายนี้ เราจำเป็นต้องขอให้ท่านยกเลิกการใช้งานแอปพลิเคชันนี้     ',
  privacy_policy_intro_05:
    '    หากท่านมีข้อกังวลเกี่ยวกับนโยบายนี้ สามารถติดต่อ สพร. ได้ตามข้อมูลติดต่อด้านล่าง ',
  privacy_policy_body_01: '1. แอปพลิเคชัน “หมอชนะ/MorChana” ช่วยดูแลได้อย่างไร',
  privacy_policy_body_01_01:
    '    1.1 มีข้อมูลช่วยสังเกตพฤติกรรมของตัวเองว่า ได้เข้าไปในสถานที่หรือพื้นที่ที่มีความเสี่ยงหรือไม่ เพื่อให้ระมัดระวังตนเอง และดูแลคนรอบข้างได้',
  privacy_policy_body_01_02:
    '    1.2 ช่วยแพทย์ พยาบาล บุคลากรทางการแพทย์ ในการสอบประวัติผู้ป่วย ช่วยให้สอบประวัติรวดเร็วขึ้น และรักษาพยาบาลได้รวดเร็วขึ้น  ',
  privacy_policy_body_01_03:
    '    1.3 เมื่อพบผู้ป่วย สามารถแจ้งเตือนผู้ที่มีความเสี่ยงจะติดเชื้อจากผู้ป่วยได้ทันที โดยไม่เสียเวลาค้นหา และให้คำแนะนำที่เหมาะสมได้ทันท่วงที เช่น ให้รีบมาพบแพทย์ที่โรงพยาบาล เป็นต้น',
  privacy_policy_body_01_04:
    '    1.4 เมื่อต้องไปในที่สาธารณะ หรือที่ที่มีคนเข้าออกจำนวนมาก เช่น ห้างสรรพสินค้า ร้านค้า หรือตลาด เป็นต้น จะมีข้อมูลช่วยในการคัดกรองผู้ป่วยหรือผู้ที่มีความเสี่ยง และช่วยดูแลผู้อื่นที่เข้าไปในสถานที่เดียวกัน',
  privacy_policy_body_02: '2. สพร. เก็บรวบรวมข้อมูลของท่านอย่างไร ',
  privacy_policy_body_02_01:
    '    จะเก็บรวบรวมข้อมูลจากท่านโดยตรง โดยเราจะเก็บรวบรวมข้อมูลของท่านตั้งแต่วันที่ท่านเริ่มใช้งานและตลอดระยะเวลาที่ท่านใช้งานแอปพลิเคชันนี้ และ สพร.จะไม่เก็บข้อมูลส่วนตัวของท่านจากแหล่งอื่น ',
  privacy_policy_body_03: '3. สพร. เก็บรวบรวมข้อมูลอะไรบ้าง ',
  privacy_policy_body_03_00:
    '    ข้อมูลที่เราจะเก็บรวบรวมจากท่านนับเป็นข้อมูลสำคัญและจำเป็น เพื่อให้แอปพลิเคชันนี้มีส่วนช่วยในการดูแลและป้องกันการระบาดของโรค COVID-19 โดยมีข้อมูลที่ต้องเก็บรวบรวมจากท่าน ดังนี้',
  privacy_policy_body_03_01:
    '    3.1 เบอร์โทรศัพท์ของท่านที่ใช้ลงทะเบียนผ่านแอปพลิเคชัน ',
  privacy_policy_body_03_02: '    3.2 ภาพถ่ายของท่าน ด้วยการเซลฟี่',
  privacy_policy_body_03_03: '    3.3 อายุของท่าน',
  privacy_policy_body_03_04: '    3.4 ที่อยู่ เฉพาะอำเภอและจังหวัดที่ท่านอยู่',
  privacy_policy_body_03_05:
    '    3.5 ข้อมูลการ Check in หรือตำแหน่งที่อยู่ (location) ของท่าน',
  privacy_policy_body_03_06:
    '    3.6 ข้อมูลการเข้าใกล้ผู้อื่นที่เก็บและคำนวณโดยแอปพลิเคชัน',
  privacy_policy_body_03_07:
    '    3.7 ข้อมูลเกี่ยวกับโอกาสในการสัมผัสโรค COVID-19 ตามแบบประเมินของโรงพยาบาล เช่น การเดินไปยังพื้นที่เสี่ยง หรือการสัมผัสหรือใกล้ชิดกับผู้ป่วย เป็นต้น',
  privacy_policy_body_03_08:
    '    3.8 ข้อมูลเกี่ยวกับอาการของโรค COVID-19 ตามแบบประเมินของโรงพยาบาล เช่น อาการไข้ เป็นต้น',
  privacy_policy_body_04: '4. สพร.ใช้ข้อมูลที่เก็บรวบรวมเพื่ออะไร',
  privacy_policy_body_04_00:
    '    เราจะใช้ข้อมูลส่วนตัวของท่านตามฐานการให้ความยินยอม (Consent) ที่กฎหมายคุ้มครองข้อมูลส่วนบุคคลอนุญาตกำหนด โดยเราจะใช้ข้อมูลของท่าน เพื่อให้นักพัฒนาตามโครงการฯนำไปวิเคราะห์ ประมวลผล และแสดงข้อมูลเกี่ยวกับพฤติกรรมของท่านเอง ว่ามีกิจกรรมที่มีความเสี่ยงหรือมีโอกาสในการสัมผัสโรค COVID-19 หรือไม่ เพื่อที่จะหลีกเหลี่ยงได้ทัน เช่น ไม่เข้าไปพื้นที่เสี่ยงที่เพิ่งพบผู้ป่วย เป็นต้น (ดูรายชื่อนักพัฒนาที่ www.dga.or.th) อย่างไรก็ดี สพร. อาจใช้ข้อมูลร่วมกันกับหน่วยงานที่เกี่ยวข้องตามฐานการประมวลผลอื่นๆในกรณีดังต่อไปนี้',
  privacy_policy_body_04_01:
    '•        กรณีจำเป็นเพื่อป้องกันหรือระงับอันตรายต่อชีวิต ร่างกาย หรือสุขภาพของท่าน',
  privacy_policy_body_04_02:
    '•	กรณีจำเป็นเพื่อปฏิบัติหน้าที่ในการดำเนินการภารกิจเพื่อประโยชน์สาธารณะ หรือปฏิบัติหน้าที่ในการใช้อำนาจรัฐที่โครงการฯได้รับมอบหมาย ซึ่งรวมถึงการส่งข้อมูลเพื่อให้หน่วยงานรัฐที่เกี่ยวข้อง ให้คำแนะนำ หรือกำหนดมาตรการป้องกันและดูแลตนเอง เช่น การให้ไปพบแพทย์ การกักตัว หรือเฝ้าระวังและสังเกตพฤติกรรมตนเอง (ดูรายชื่อหน่วยงานรัฐที่เกี่ยวข้องที่ www.dga.or.th) และเพื่อให้ข้อมูลแก่แพทย์ พยาบาล หรือบุคลากรทางการแพทย์ เกี่ยวกับประวัติการเข้าไปยังสถานที่หรือพื้นที่ที่มีความเสี่ยงหรือมีโอกาสในการสัมผัสโรค COVID-19 ตลอดจนอาการที่อาจเข้าข่ายของโรค COVID-19 (ดูรายชื่อหน่วยงานงานทางสาธารณสุขที่เกี่ยวข้องที่ www.dga.or.th))',
  privacy_policy_body_04_03:
    '•	กรณีจำเป็นเพื่อประโยชน์โดยชอบด้วยกฎหมายของโครงการฯ หรือของบุคคล หรือนิติบุคคลอื่น โดยไม่ให้สิทธิขั้นพื้นฐานของท่านได้รับผลกระทบกระเทือน',
  privacy_policy_body_04_04:
    '    ทั้งนี้ สพร.มีมาตรการรักษาความมั่นคงปลอดภัยของข้อมูลที่เหมาะสมเพื่อป้องกันมิให้นำไปใช้นอกเหนือวัตถุประสงค์หรือนำไปใช้หรือเปิดเผยโดยมิชอบ ',
  privacy_policy_body_05: '5. การแบ่งปันข้อมูล',
  privacy_policy_body_05_00:
    '    สพร.จะไม่เผยแพร่ จำหน่าย จ่าย แจก แลกเปลี่ยน หรือถ่ายโอนข้อมูลส่วนตัวใดๆ ของท่านที่ สพร.ได้เก็บรวบรวมไว้ให้แก่บุคคลภายนอก หรือหน่วยงานที่ไม่เกี่ยวข้อง เว้นแต่เมื่อได้รับการร้องขอหรือได้รับความยินยอมอย่างชัดแจ้งจากท่าน ',
  privacy_policy_body_06: '6. การประมวลผลและโอนข้อมูล',
  privacy_policy_body_06_00:
    '    โครงการฯมีการใช้การประมวลผลข้อมูลโดยระบบคลาวด์ของ AWS (ดูนโยบายคุ้มครองข้อมูลส่วนบุคคลของ AWS ที่ https://aws.amazon.com/th/compliance/gdpr-center/) โดยไม่มีการส่งหรือโอนข้อมูลไปยังต่างประเทศ (Cross-border Data Transfer, ดูคำอธิบายการส่งหรือข้อมูลไปต่างประเทศที่ TDPG2.0 ส่วน F) และ สพร. มีมาตรการรักษาความมั่นคงปลอดภัยของข้อมูลที่เหมาะสมเพื่อป้องกันมิให้นำไปใช้นอกเหนือวัตถุประสงค์หรือนำไปใช้หรือเปิดเผยโดยมิชอบ ',
  privacy_policy_body_07: '7. ระยะเวลาในการเก็บข้อมูล ',
  privacy_policy_body_07_00:
    '    สพร.จะเก็บรักษาข้อมูลของท่านเป็นระยะเวลาเท่าที่จำเป็น เพื่อวัตถุประสงค์โดยชอบด้วยกฎหมายและเพื่อการทำงานและการให้บริการแอปพลิเคชันเป็นไปอย่างมีประสิทธิภาพ โดยภายใน 30 วันนับจากวันที่สถานการณ์การแพร่ระบาดของโรค COVID-19 สิ้นสุดลง โดยได้มีการยกเลิกการบังคับใช้ของกฎหมายในสถานการณ์ฉุกเฉิน และจะมีการลบ ทำลายหรือทำให้ข้อมูลของท่านไม่สามารถระบุตัวตนได้ด้วยวิธีการที่เหมาะสมและเป็นไปตามมาตรฐานสากล ',
  privacy_policy_body_07_01:
    '    ทั้งนี้ หากท่านมีการร้องขอ สพร.จะดำเนินการลบหรือทำให้ข้อมูลส่วนตัวของท่านไม่สามารถระบุตัวตนของท่านได้ เว้นแต่เป็นข้อกำหนดทางกฎหมายที่ สพร. จำเป็นต้องดำเนินการเพื่อเก็บรักษาข้อมูลบางอย่างไว้ โดยตลอดระยะเวลาที่ สพร.เก็บรวบรวมข้อมูล สพร.จะจัดเก็บและดูแลข้อมูลภายใต้มาตรการการรักษาความมั่นคงปลอดภัยที่เคร่งครัด ',
  privacy_policy_body_08: '8. สิทธิในข้อมูลของท่าน ',
  privacy_policy_body_08_00:
    '    กฎหมายคุ้มครองข้อมูลส่วนบุคคลได้ให้สิทธิท่านในการเข้าถึงข้อมูลของท่านที่เราได้มีการเก็บรวบรวมและประมวลผล รวมถึงขอสำเนาข้อมูล แก้ไขข้อมูล ลบข้อมูล จำกัดหรือคัดค้านการประมวลผลข้อมูล หรือเพิกถอนความยินยอมในข้อมูลส่วนตัวของท่าน',
  privacy_policy_body_08_01:
    '    หากท่านมีความประสงค์ที่จะใช้สิทธิดังกล่าวข้างต้น โปรดแจ้งความประสงค์ดังกล่าวมายัง สพร.ได้ตามช่องทางการติดต่อด้านล่าง โดย สพร. จะตอบกลับและดำเนินการภายใน 30 วัน นับแต่วันที่ได้รับแจ้ง ',
  privacy_policy_body_09: '9. การเปลี่ยนแปลงนโยบายความเป็นส่วนตัว ',
  privacy_policy_body_09_00:
    '    นโยบายนี้อาจมีการแก้ไขหรือปรับปรุงเป็นครั้งคราว ท่านควรเข้ามาตรวจสอบนโยบายนี้สม่ำเสมอเพื่อให้แน่ใจว่าท่านได้รับทราบนโยบายฉบับล่าสุด หากท่านยังคงใช้งานแอปพลิเคชันนี้ภายหลังจากวันที่มีการแก้ไขหรือปรับปรุงนโยบายแล้ว ถือว่าท่านยอมรับนโยบายทั้งหมดทั้งในส่วนของนโยบายที่มีอยู่แล้ว และนโยบายที่มีการแก้ไขปรับปรุงเพิ่มเติมด้วย ',
  privacy_policy_body_10: '10. ติดต่อเรา',
  privacy_policy_body_10_00:
    '    หากมีข้อสงสัย หรือต้องการสอบถามข้อมูลที่เกี่ยวข้องกับข้อมูลส่วนบุคคล โปรดติดต่อได้ที่ ',
  privacy_policy_dga_contact_name:
    '    สำนักงานพัฒนารัฐบาลดิจิทัล (องค์การมหาชน) (สพร.) ',
  privacy_policy_dga_contact_address_01:
    '    ชั้น 17 อาคารบางกอกไทยทาวเวอร์ 108 ถนนรางน้ำ แขวงถนนพญาไท ',
  privacy_policy_dga_contact_address_02: '    เขตราชเทวี กรุงเทพฯ 10400',
  privacy_policy_dga_contact_tel: '    Contact Center : (+66) 0 2612 6060 ',
  privacy_policy_dga_contact_email: 'อีเมล : contact@dga.or.th',
  privacy_policy_contact_call_center:
    '    หรือเกี่ยวกับการใช้งานแอปพลิเคชันนี้ โทร 1111 ศูนย์บริการข้อมูลภาครัฐเพื่อประชาชน (Government Contact Center : GCC 1111)',
  privacy_policy_ending01:
    '    สพร. จะพยายามอย่างเต็มที่ในการช่วยเหลือ แก้ไขข้อกังวลและปัญหาต่างๆ ที่ท่านแจ้งมายังเรา',
  privacy_policy_ending02:
    'นโยบายความเป็นส่วนตัวนี้มีผลบังคับใช้ตั้งแต่วันที่ 27 เมษายน 2563',
  privacy_policy_version: 'เวอร์ชั่น 2020.2',
  change_lang: 'เปลี่ยนภาษา',
  back: 'ย้อนกลับ',
  beacon_header: 'คุณได้พบ Beacon',
  notification_history: 'แจ้งเตือน',
  notification_history_empty: 'ไม่มีการแจ้งเตือน',
}
